# 04 - Grouping

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.

In [4]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [52]:
regiment.set_index(['regiment', 'company'])

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [21]:
preteset = regiment.pivot_table(index='regiment', columns='regiment', aggfunc='mean', fill_value=0)
preteset

           postTestScore                   preTestScore
regiment        Dragoons Nighthawks Scouts     Dragoons Nighthawks Scouts
regiment
Dragoons            61.5        0.0      0         15.5       0.00    0.0
Nighthawks           0.0       59.5      0          0.0      15.25    0.0
Scouts               0.0        0.0     66          0.0       0.00    2.5

In [23]:
preteset.keys()

MultiIndex([('postTestScore',   'Dragoons'),
            ('postTestScore', 'Nighthawks'),
            ('postTestScore',     'Scouts'),
            ( 'preTestScore',   'Dragoons'),
            ( 'preTestScore', 'Nighthawks'),
            ( 'preTestScore',     'Scouts')],
           names=[None, 'regiment'])

In [24]:
preteset["preTestScore"]["Nighthawks"]

regiment
Dragoons       0.00
Nighthawks    15.25
Scouts         0.00
Name: Nighthawks, dtype: float64

In [40]:
import time
nighthawks = pd.DataFrame(regiment.groupby("regiment")["preTestScore"].mean())
nighthawks.loc["Nighthawks"]

preTestScore    15.25
Name: Nighthawks, dtype: float64

In [42]:
%%timeit

nighthawks = pd.DataFrame(regiment.groupby("regiment")["preTestScore"].mean())
nighthawks.loc["Nighthawks"]

960 µs ± 129 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [43]:
%%timeit
regiment[regiment["regiment"] == "Nighthawks"]["preTestScore"].mean()

347 µs ± 20.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)


### Step 5. Present general statistics by company

In [48]:
regiment.groupby("company").describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

### Step 6. What is the mean of each company's preTestScore?

In [49]:
regiment.groupby("company")["preTestScore"].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [51]:
regiment.groupby(["regiment","company"])["preTestScore"].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [53]:
w_h = regiment.groupby(["regiment","company"])["preTestScore"].mean()
w_h.unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [56]:
regiment.pivot_table(index='regiment', columns='company',
                    aggfunc="mean")["preTestScore"]

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [70]:
regiment.set_index(['regiment', 'company'])

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

### Step 10. What is the number of observations in each regiment and company

In [64]:
regiment["regiment"].count()

12

In [66]:
regiment["company"].count()

12

In [67]:
regiment.groupby(["company","regiment"]).size()

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
dtype: int64

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [71]:
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [72]:
for x, y in regiment.groupby("regiment"):
    print(x)
    print(y)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70